Tekla.Structures.Internal.dotIdentifier_t
Identifier class serialization.

Tekla.Structures.Internal.dotIdentifier_t.ID
ID.

Tekla.Structures.Internal.dotIdentifier_t.ID2
Sub ID.

Tekla.Structures.Internal.dotIdentifier_t.aGUID


Tekla.Structures.Internal.dotIdentifier_t.#ctor(Tekla.Structures.Identifier)
Constructs a serialization struct from a public API class.
identifier: The identifier.

Tekla.Structures.Internal.dotIdentifier_t.CreateTeklaStructuresGuid(Tekla.Structures.Identifier)
Creates a guid in Tekla Structures Format.
identifier: The identifier to create from.

Tekla.Structures.Internal.dotIdentifier_t.ToStruct(Tekla.Structures.Identifier)
From Identifier to dotIdentifier_t.
identifier:

Tekla.Structures.Internal.dotIdentifier_t.FromStruct
From dotIdentifier_t to Identifier.

Tekla.Structures.Internal.dotIdentifier_t.GetGuidFromMaybeTsGuid(System.String)
Construct a Guid object from a guid string (36 chars).
maybeTsGuid: Tekla Structures guid or normal guid.
Returns: The constructed guid

Tekla.Structures.Internal.dotIdentifier_t.FromStruct(Tekla.Structures.Identifier)
From dotIdentifier_t to Identifier.
identifier: